app/Controllers/Auth.php

INSERT INTO `users` (`user_name`, `user_email`, `user_password`) VALUES ('teste', 'teste@gmail.com', '$2y$12$NGHOl4sChss5j9oKdfMdL.i.stutYut/nXn3XG/bN.m9w6n71aVt.')
---
    public function register()
    {
        // 1. Regras de validação (os nomes precisam bater com os 'name' do seu formulário HTML)
        $rules = [
            'name'     => 'required|min_length[3]',
            // is_unique garante que ninguém crie duas contas com o mesmo email na tabela users
            'email'    => 'required|valid_email|is_unique[users.user_email]',
            'password' => 'required|min_length[4]',
            'confirm'  => 'matches[password]' // Garante que a confirmação de senha é idêntica
        ];

        // 2. Se a validação falhar
        if (! $this->validate($rules)) {
            // Você pode capturar esses erros na view depois. Por enquanto, mandamos um erro genérico:
            session()->setFlashdata('error', 'Erro ao criar conta. Verifique os dados ou se o email já existe.');
            return redirect()->to('auth');
        }

        // 3. Pegando os dados do formulário
        $name     = $this->request->getPost('name');
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // 4. Criptografando a senha (ISSO FAZ O LOGIN FUNCIONAR DEPOIS!)
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        // 5. Salvando no banco de dados usando o Model
        $this->userModel->insert([
            'user_name'     => $name,
            'user_email'    => $email,
            'user_password' => $hashedPassword
        ]);