app/Models/UserModel.php

    public function findByEmail($email)
    {
        return $this -> where('user_email', $email)->first();
---
SELECT *
FROM `users`
WHERE `user_email` = 'mellojoaopedro20@gmail.com'
 LIMIT 1